const blogPosts = [
    {
      id: 1,
      title: 'Что такое микроразметка и зачем она нужна?',
      author: 'Иван Иванов',
      date: '2024-11-15',
      description: 'Узнайте, что такое микроразметка, зачем она нужна и как она работает.',
      content: `Микроразметка - это способ разметки данных на веб-странице, который помогает поисковым системам и другим сервисам лучше понимать содержание страницы. ...`,
      image: `url("")`
    },
    {
      id: 2,
      title: 'Как использовать Schema.org для микроразметки?',
      author: 'Петр Петров',
      date: '2024-11-10',
      description: 'Руководство по использованию Schema.org для микроразметки: типы, свойства и примеры.',
      content: `Schema.org - это совместная инициатива Google, Bing, Yahoo! и Yandex по созданию общей схемы для разметки данных в интернете. ...`,
        image: `url("")`
    },
    {
      id: 3,
      title: 'JSON-LD, Microdata и RDFa: какой формат выбрать?',
      author: 'Анна Смирнова',
      date: '2024-11-05',
      description: 'Сравнение форматов микроразметки: JSON-LD, Microdata и RDFa. Какой формат лучше выбрать для вашего сайта?',
      content: `Существует несколько форматов микроразметки, таких как JSON-LD, Microdata и RDFa. Каждый из них имеет свои преимущества и недостатки. ...`,
        image: `url("")`
    },
  ];
  
  export default blogPosts;